# TODO: normal and lowercase versions
SEXES = ("мужчина", "женщина")
CITIES = ("москва", "санкт-петербург")
RELATIONSHIP_GOALS = ("долгосрочные отношения", "краткосрочные отношения", "просто общение")

NO_INTERESTS = 5
INTERESTS = (
        "Путешествия",
        "Фотография",
        "Готовка",
        "Фитнес и спорт",
        "Чтение",
        "Искусство и рукоделиe",
        "Музыка",
        "Танцы",
        "Садоводство",
        "Волонтерство",
        "Экстремальный спорт",
        "Языки и культуры",
        "Кино и сериалы",
        "Компьютерные игры",
        )

LIKE_EMOJI = u'👍'
DISLIKE_EMOJI = u'👎'
CHECK_MARK_EMOJI = u'✅'
