NO_USERS = 20

MIN_AGE = 18
MAX_AGE = 30

MALE_NAMES = ("Ваня", "Олег", "Леша", "Макс", "Егор")
MALE_PHOTOS = (
    "AgACAgIAAxkBAAICzWS5DnW6U2TyZ6TfTT4eEEakPXm3AAIBzTEbpczISae1JFX2jBgkAQADAgADcwADLwQ",
)
        # "AgACAgIAAxkBAAPTZJ6UzwzkGrBNKoCREV_wOZZeS-sAAsHMMRt--PFIAAHRjBjaArQ9AQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAPaZJ6Vi7G_R-71mT-BgVCRB5BIMdkAAsjMMRt--PFIvhO86_6XvlMBAAMCAANzAAMvBA"]


FEMALE_NAMES = (
        "Лия",
        "Анастасия",
        "Александра",
        "Дарья",
        "Анна",
        "Мария",
        "Елена",
        "Ксения",
        "София",
        "Екатерина",
        "Наталья",
        "Вероника",
        "Валерия",
        "Диана",
        "Маргарита",
        "Юлия",
        "Алина",
        "Ольга",
        "Арина",
        "Татьяна",
        )

FEMALE_PHOTOS = (
    "AgACAgIAAxkBAAICzWS5DnW6U2TyZ6TfTT4eEEakPXm3AAIBzTEbpczISae1JFX2jBgkAQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAPRZJ6UlQOepvv5gbtP52npF5jk7p4AAsLMMRt--PFIDlOStB3xcjsBAAMCAANzAAMvBA",
        # "AgACAgIAAxkBAAPXZJ6VakWrRZRSYDJxwqBXNnR-NxMAAsfMMRt--PFI_F7X1LUUmAEBAAMCAANzAAMvBA",
        # "AgACAgIAAxkBAAIC4GSf6Ng8d4O0VhwX8o-UQlbXRidmAAIEyjEbfvgBSc5S0y8hYOmiAQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAIC4mSf6O5yL0g_QMF9t2UhVR44xbmGAAIFyjEbfvgBSXY_4yV1vkmEAQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAILR2SmrsrBo9oaXD4YmrAgaj0d0-VUAAIl0DEbdg85SdGhjwb0VtQtAQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAILSWSmrte1TNnQ-XMWvDzjDzYvbf-BAAIm0DEbdg85SUsigq5Bn2FtAQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAILS2SmruApy_LWL_Iw4UoqZeFIRRJPAAIn0DEbdg85SQYoO0zYMscpAQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAILTWSmruW_yeVXmrVmLQZy5PdCO0VHAAIo0DEbdg85Sc_ZO0GroRoZAQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAILT2SmrvZKvquG8SaSMtTnboS9cWrNAAIp0DEbdg85SVAgZ3fUf5eKAQADAgADcwADLwQ",
        # "AgACAgIAAxkBAAILUWSmrvzF1jVcEHa2FmRd_zkD9kaWAAIq0DEbdg85SThra6_lc43lAQADAgADcwADLwQ",
        )

MALE_SELF_DESCRIPTIONS = (
        "Я активный, веселый, дружелюбный парень со стремлением к достижению больших вещей. Ищу партнершу, с которой могу проводить незабываемое время. Я люблю играть в видео игры, хорошо знаю Питон и С++, интересуюсь веб-разработкой и дизайном.",
        "Я душевный, интеллигентный, интровертный мужчина, охотный путешественник и большой любитель кино. Я чувствую себя комфортно со всеми и рад исследовать новое. У меня есть крепкие компьютерные навыки и уверенные знания в программировании, самоучитель C++, Python и веб-разработки.",
        "Я социальный и энергичный мужчина, увлекающийся всеми аспектами жизни. Люблю путешествовать, любящий друга и защитник, социально активный и помогающий другим. Хорошо знаю Питон, С++, Rust и веб-распространение, а также люблю играть панк и хард-рок.")

FEMALE_SELF_DESCRIPTIONS = (
        "Привет! Я веселая и энергичная девушка, которая любит активный образ жизни. Обожаю путешествовать, открывать новые места и встречать интересных людей. Ищу партнера, с которым смогу делить свои приключения и создавать незабываемые воспоминания.",

"Приветствую! Я творческая и нежная девушка, увлекающаяся искусством и музыкой. Мои увлечения включают рисование, пение и танцы. Ищу вторую половинку, с кем смогу разделить свои творческие идеи и вместе создавать что-то прекрасное.",

"Привет! Я интеллектуальная и целеустремленная девушка, увлеченная наукой и образованием. Люблю читать книги, учиться чему-то новому и развиваться как личность. Ищу партнера, с кем смогу вести умные и глубокие разговоры, а также поддерживать и вдохновлять друг друга на достижение целей.",

"Привет! Я заботливая и семейно ориентированная девушка, ценящая домашний уют и теплые отношения. Обожаю готовить вкусные блюда, проводить время с близкими и заботиться о своих близких. Ищу партнера, с кем смогу создать крепкую и счастливую семью.",

"Привет! Я спортивная и здоровая девушка, увлеченная фитнесом и заботой о своем теле. Люблю заниматься спортом, ходить в тренажерный зал и заниматься йогой. Ищу партнера, который разделяет мою страсть к здоровому образу жизни и готов вместе достигать новых спортивных целей.",
"Привет! Я люблю приключения и адреналин! Обожаю кататься на сноуборде, прыгать с парашютом и путешествовать в отдаленные уголки мира. Ищу партнера, который разделит со мной страсть к экстремальным видам спорта и готов погрузиться в увлекательные приключения!",
"Привет! Я мечтательная и романтичная натура, которая ценит глубокие разговоры и эмоциональную связь. Обожаю читать книги, слушать музыку и проводить время с близкими людьми. Ищу партнера, с кем смогу разделить свои мысли, чувства и создать настоящую душевную связь.",
"Привет! Я люблю природу и заботу о окружающей среде. У меня есть собственный огород, где я выращиваю органические овощи и фрукты. Также активно занимаюсь рециклингом и экологическим образом жизни. Ищу партнера, который разделяет мою заботу о планете и готов внести свой вклад в сохранение окружающей среды.",
"Привет! Я творческая душа, которая обожает музыку и танцы. Я активно занимаюсь балетом и люблю выступать на сцене. Кроме того, я играю на гитаре и пою. Ищу партнера, который разделяет мою любовь к искусству и готов разделить со мной музыкальные и танцевальные моменты.",
"Привет! Я энтузиастка фитнеса и здорового образа жизни. Обожаю заниматься в тренажерном зале, ходить на йогу и пробовать новые виды спорта. Ищу партнера, который разделяет мою страсть к физической активности и готов вместе со мной достигать новых спортивных целей!",
)
